Autodesk.Revit.DB.FormaBuilding.SetProfiles(System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.FormaBuilding.GetProfiles
Since:
2027

Autodesk.Revit.DB.FormaBuilding.GetId
Since:
2027

Autodesk.Revit.DB.FormaBuilding.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FormaBuilding.#ctor(System.String,System.Collections.Generic.IList{Autodesk.Revit.DB.CurveLoop})
constructor for Forma building
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2027

Autodesk.Revit.DB.FormaBuilding
Forma building data
Since:
2027